CARAVAN/app/controllers/blogs_controller.rb

  def index
    # 記事を全件取得
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def update
      blog = Blog.find(params[:id])
      blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "category" = ?, "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["category", "a"], ["body", "ff"], ["updated_at", "2020-02-01 08:09:48.329796"], ["id", 1]]