Bookers/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "k"], ["created_at", "2020-02-07 08:50:11.733023"], ["updated_at", "2020-02-07 08:50:11.733023"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:create] = "Book was successfully created"
      redirect_to book_path(@book)
    else
      @books = Book.all